Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_UsingSwiftWithCocoaAndObjective-C/Swift_BCA-level2.tmx
Source language: en_us
Languages: ja

source: In Objective-C, you typically use the NSLocalizedString family of macros to localize strings.
ja: Objective-Cでは、あなたは一般的に文字列を現地語化するためにマクロのNSLocalizedStringファミリーを使います。

source: In Objective-C, you use the isKindOfClass: method to check whether an object is of a certain class type, and the conformsToProtocol: method to check whether an object conforms to a specified protocol.
ja: Objective-Cでは、あるオブジェクトが特定のクラス型かどうか調べるためにisKindOfClass:を、そしてオブジェクトが指定されたプロトコルに準拠するかどうか調べるためにconformsToProtocol:を使います。

source: In Objective-C, you use the respondsToSelector: and instancesRespondToSelector: methods to check for the availability of a class or instance method.
ja: Objective-Cでは、あなたはrespondsToSelector:とinstancesRespondToSelector:メソッドを使ってクラスおよびインスタンス・メソッドの有効性を確認します。

source: In Objective-C, you work with references to objects using raw pointers that could be NULL (referred to as nil in Objective-C).
ja: Objective-Cでは、あなたはオブジェクトへの参照を、NULL（Objective-Cではnilと呼ばれます）であることができる生のポインターを使って扱います。

source: In Swift as well as Objective-C, attempting to call a method that does not exist triggers an unrecognized selector error.
ja: スウィフトではObjective-C同様に、存在しないメソッドを呼び出す試みは、識別不能セレクタエラーの引き金となります。

source: In Swift, Objective-C selectors are represented by the Selector structure, and can be constructed using the #selector expression.
ja: スウィフトでは、Objective-CセレクタはSelector構造体によって表されます、そして#selector式を使って組み立てられることができます。

source: In Swift, a null pointer is represented by a nil value of an optional pointer type.
ja: スウィフトでは、ヌルポインタはオプショナルポインタ型のnil値によって表されます。

source: In Swift, a stored property with an initial value can be declared with the lazy modifier to have the expression calculating the initial value only evaluated when the property is first accessed:
ja: スウィフトでは、初期値を持つ保存プロパティがlazy修飾子を使って宣言されると、初期値を計算する式は、そのプロパティが最初にアクセスされる時に初めて数値を求められるようになります。

source: In Swift, all values—including structures and object references—are guaranteed to be non–null.
ja: スウィフトでは、すべての値は ― 構造体やオブジェクト参照を含めて ― 非nullであることを保証されます。

source: In Swift, attempting to call a method that is not supported on all targeted platform versions causes a compile-time error.
ja: スウィフトでは、ターゲットにされるすべてのプラットホーム上でサポートされないメソッドを呼び出す試みは、コンパイル時エラーを生じさせます。

source: In Swift, calling a method that throws requires explicit error handling.
ja: スウィフトでは、スローするメソッドを呼び出すことは明確にエラー処理することを必要とします。

source: In Swift, global constants and stored type properties are guaranteed to be initialized only once, even when accessed across multiple threads simultaneously.
ja: スウィフトでは、グローバル定数と保存型プロパティは、ただ一度だけ初期化されることを保証されます、複数のスレッドをまたいで同時にアクセスされた時でさえもです。

source: In Swift, it’s imported like this:
ja: スウィフトでは、それはこのようにインポートされます：

source: In Swift, option sets are represented by structures conforming to the OptionSet protocol, with static variables for each option value.
ja: スウィフトでは、オプションセットはOptionSetプロトコルに準拠している構造体によって表され、静的変数を各オプション値に対して持ちます。

source: In Swift, the Objective-C copy property attribute translates to @NSCopying.
ja: スウィフトでは、Objective-Cのcopyプロパティ属性は、@NSCopyingとして解釈します。

source: In Swift, the functionality of these macros is made available through a single function: NSLocalizedString(_:tableName:bundle:value:comment:).
ja: スウィフトでは、これらのマクロの機能性は、ただ１つの関数：NSLocalizedString(_:tableName:bundle:value:comment:)を通して利用可能にされます。

source: In Swift, the standard library defines a standardized approach to data encoding and decoding.
ja: スウィフトでは、標準ライブラリが標準化された取り組みをデータのエンコーディングとデコーディングに対して定義します。

source: In Swift, there are no readwrite and readonly attributes.
ja: スウィフトでは、readwriteとreadonly属性はありません。

source: In Swift, this pattern is built into a language feature called failable initialization.
ja: スウィフトでは、このよくある操作は失敗できる初期化と呼ばれる言語機能に組み込まれます。

source: In Swift, those header files are compiled down to Objective-C modules, which are then imported into Swift as Swift APIs.
ja: スウィフトにおいて、それらのヘッダ・ファイルはObjective-Cモジュールに至るまでコンパイルされます、それらは、それからスウィフトにスウィフト APIとしてインポートされます。

source: In Swift, you accomplish this task by using the is operator to check for a type, or the as? operator to downcast to that type.
ja: スウィフトでは、あなたは、ある型か調べるis演算子、またはその型にダウンキャストするas?演算子を使うことによってこの作業を達成します。

source: In Swift, you call it like this:
ja: スウィフトでは、あなたはそれをこのように呼び出します：

source: In Swift, you can also use the #keyPath string expression to create compiler-checked keys and key paths that can be used by KVC methods like value(forKey:) and value(forKeyPath:), and KVO methods like addObserver(_:forKeyPath:options:context:).
ja: スウィフトでは、あなたは#keyPath文字列式を使うことでコンパイラチェック済みのキーやキーパスを作成できます、それらはvalue(forKey:)とvalue(forKeyPath:)のようなKVCメソッドおよびaddObserver(_:forKeyPath:options:context:)のようなKVOメソッドによって使われることができます。

source: In Swift, you can call C variadic functions, such as vasprintf, using the getVaList(_:) or withVaList(_:_:) functions.
ja: スウィフトにおいて、あなたはCの可変長引数関数、例えばvasprintfなどを呼び出すことがgetVaList(_:)またはwithVaList(_:_:)関数を使って可能です。

source: In Swift, you can define protocols that Objective-C classes can conform to.
ja: スウィフトにおいて、あなたはObjective-Cクラスが準拠できるプロトコルを定義できます。

source: In Swift, you can define subclasses of Objective-C classes.
ja: スウィフトにおいて、あなたはObjective-Cクラスのサブクラスを定義することができます。

source: In Swift, you can interact with the unified logging system using the top level os_log(_:dso:log:type:_:) function, found in the log submodule of the os module.
ja: スウィフトでは、あなたは統合ログシステムとトップレベルのos_log(_:dso:log:type:_:)関数、osモジュールのlogサブモジュールで見つかります、を使ってやり取りできます。

source: In Swift, you can simply use a static type property, which is guaranteed to be lazily initialized only once, even when accessed across multiple threads simultaneously:
ja: スウィフトでは、あなたは単にstatic型プロパティを使うことができます、それは、複数のスレッドから同時にアクセスされる時でさえも、ただ一度だけ遅延初期化されることを保証します：

source: In Swift, you can use a key-path expression to create key paths for accessing properties.
ja: スウィフトでは、あなたはキーパス式を使うことで、プロパティにアクセスするためのキーパスを作成できます。

source: In Swift, you can use each pair of toll-free bridged Foundation and Core Foundation types interchangeably.
ja: スウィフトにおいて、あなたは、無料の橋渡しされたファウンデーションとコアファウンデーション型のそれぞれの対を入れ替えて使うことができます。

source: In Swift, you can use functions and generics to achieve the same results without any compromises.
ja: スウィフトでは、あなたはどんな妥協もなしで同じ結果を成し遂げるために、関数と総称体を使用することができます。

source: In Swift, you can use optional chaining to invoke an optional protocol method on a possibly nil object and unwrap the possible result using if–let syntax.
ja: スウィフトでは、あなたはオプショナル連鎖を使用することで、オプショナルのプロトコルメソッドをもしかするとnilであるオブジェクト上で呼び出してif–let構文を使って可能な結果をアンラップすることができます。

source: In Swift, you can use the autoreleasepool(_:) function to execute a closure within an autorelease pool block.
ja: スウィフトでは、あなたはautoreleasepool(_:)関数を使って、あるクロージャをオートリリース・ブロックの内部で実行できます。

source: In Swift, you do this:
ja: スウィフトでは、あなたはこうします：

source: In Swift, you must use the full name of your document subclass, including the module name derived from the name of your app or framework.
ja: スウィフトにおいて、あなたは、あなたのアプリまたはフレームワークの名前から引き出されるモジュール名を含めて、あなたのドキュメントサブクラスの完全な名前を使う必要があります。

source: In Swift, you specify these property attributes in a different way.
ja: スウィフトにおいて、あなたは異なる方法でこれらのプロパティ属性を指定します。

source: In Swift, you use the @available attribute to control whether a declaration is available to use when building an app for a particular target platform.
ja: スウィフトでは、あなたは@available属性を使うことで、ある宣言が利用可能であるかどうかを制御して、特定の対象プラットホームのためにアプリをビルドするときに使うようにします。

source: In Swift, you use the Selector type to refer to Objective-C selectors.
ja: スウィフトにおいて、あなたはObjective-Cセレクタに言及するためにSelector型を使います。

source: In Swift, you write try? to change a throwing expression into one that returns an optional value, and then check whether the value is nil.
ja: スウィフトでは、あなたはtry?を書くことで、スローする式をオプショナルの値を返すものへと変えて、それからその値がnilかどうかを調べます。

source: In addition to arrays, Swift bridges between the Set type and the NSSet class.
ja: 配列に加えて、スウィフトはSet型とNSSetクラスの間を橋渡しします。

source: In addition, many of the Cocoa frameworks, including Foundation, AppKit, and UIKit refine their APIs to be more natural in Swift.
ja: 加えて、Foundation、AppKit、そしてUIKitを含む、多くのCocoaフレームワークは、それらのAPIをSwiftにおいてより自然なものに改良されます。

source: In both Swift and Objective-C, delegation is often expressed with a protocol that defines the interaction and a conforming delegate property.
ja: スウィフトとObjective-Cの両方で、委任は、相互作用を定義するプロトコルと準拠している委任プロパティでたいてい表されます。

source: In contrast with condition compilation in the C preprocessor, conditional compilation blocks in Swift must completely surround blocks of code that are self-contained and syntactically valid.
ja: Cプリプロセッサでの条件コンパイルと対照的に、スウィフトでの条件コンパイルブロックは、自給自足で統語論的に有効であるコードのブロックを完全に伴っていなければなりません。

source: In contrast, the methods that perform a selector on a specific thread or after a delay, such as perform(_:on:with:waitUntilDone:modes:) and perform(_:with:afterDelay:), don’t return a value.
ja: 対照的に、セレクタを特定のスレッド上やある猶予の後で実行するメソッド、例えばperform(_:on:with:waitUntilDone:modes:)そしてperform(_:with:afterDelay:)は、値を返しません。

source: In fact, when Swift code imports Objective-C APIs, the importer replaces Objective-C reference types with their corresponding value types.
ja: 実際、スウィフトコードがObjective-C APIをインポートするとき、インポーターはObjective-C参照型をそれらの対応する値型と置き換えます。

source: In many cases, you can use Swift language features to extend or simplify existing Cocoa patterns, making them more powerful and easier to use.
ja: 多くの場合に、あなたは既存のココア・パターンを拡張したり、単純化するためにスウィフト言語の特徴を働かせることができます。そして、それらをより強力でより使いやすくします。

source: In most cases, it’s safer and more convenient to cast the object to AnyObject and use optional chaining with a method call as described in id Compatibility.
ja: ほとんどの場合には、より安全でいっそう便利なのはそのオブジェクトをAnyObjectにキャストして、メソッド呼び出しとともにオプショナル連鎖を使うことです、id互換性で記述されるように。

source: In most cases, you should not need to modify this setting.
ja: ほとんどの場合、あなたはこの説定を修正する必要がないはずです。

source: In order to preserve namespacing when a Swift class is used in Objective-C code, Swift classes are exposed to the Objective-C runtime with their fully qualified names.
ja: スウィフトクラスがObjective-Cコードの中で使用されるときに名前空間を保護する目的で、スウィフトクラスたちはそれらの完全修飾名を使ってObjective-Cランタイムに露出されます。

source: In order to retrieve a Swift class, the fully qualified name, including the name of the app, is used.
ja: あるスウィフトクラスを取り出すために、その完全修飾名が、そのアプリの名前を含めて、使用されます。

source: In other words, the behavior of __block in Objective-C is the default behavior for variables in Swift.
ja: 言い換えると、Objective-Cでの__blockの挙動は、スウィフトの中の変数のための初期状態での挙動です。

source: In some cases, you need finer grained control over how your Swift API is exposed to Objective-C.
ja: いくつかの場合に、あなたはよりきめ細かな管理をあなたのスウィフト APIがObjective-Cに露出される方法に対して必要とします。

source: In the example above, the CFArrayCallBacks initializer uses nil values as arguments for the retain and release parameters, the customCopyDescription(_:) function as the argument for the customCopyDescription parameter, and a closure literal as the argument for the equal parameter.
ja: 上の例において、CFArrayCallBacksイニシャライザはnil値をretainとreleaseパラメーターに対する引数として、customCopyDescription(_:)関数をcustomCopyDescriptionパラメーターに対する引数として、そしてクロージャリテラルをequalパラメーターに対する引数として使います。

source: In the example below, changing the value of the isAlive computed property on an instance of the SchroedingersCat structure also changes the value of the instance’s isDead computed property:
ja: 下の例において、isAlive計算プロパティの値をSchroedingersCat構造体のインスタンス上で変更することは、またそのインスタンスのisDead計算プロパティの値も変更します：

source: In the example below, the NSClassFromString(_:) function is used to retrieve a reference to a class from its string representation.
ja: 以下の例において、NSClassFromString(_:)関数は、あるクラスへの参照をそれの文字列表現から取り出すために使われます。

source: In your Objective-C bridging header file, import every Objective-C header you want to expose to Swift.
ja: あなたのObjective-C橋渡しヘッダ・ファイルにおいて、あなたがスウィフトに露出したいあらゆるObjective-Cヘッダをインポートしてください。

source: In your umbrella header file, import every Objective-C header you want to expose to Swift.
ja: あなたのアンブレラヘッダ・ファイルにおいて、あなたがスウィフトに露出したいあらゆるObjective-Cヘッダをインポートしてください。

source: Individual type declarations can be audited using the _Nullable and _Nonnull annotations, individual property declarations can be audited using the nullable, nonnull and null_resettable property attributes, or entire regions can be audited for nullability using the NS_ASSUME_NONNULL_BEGIN and NS_ASSUME_NONNULL_END macros.
ja: 個々の型宣言は_Nullableと_Nonnull注釈を使って監査されることができます、個々のプロパティ宣言はnullable、nonnull、そしてnull_resettableプロパティ属性を使って監査されることができます、または領域全体がヌル許可について監査されることがNS_ASSUME_NONNULL_BEGINとNS_ASSUME_NONNULL_ENDマクロを使って可能です。

source: Inheriting from Objective-C Classes
ja: Objective-Cクラスから継承する

source: Initialization
ja: 初期化

source: Initializer methods are imported by Swift with double underscores (__) prepended to their first argument labels.
ja: イニシャライザメソッドは、二重アンダースコア（__）をそれの最初の引数ラベルの前に付けられてスウィフトによってインポートされます。

source: Instead, create an Objective-C or C wrapper for C++ code.
ja: その代わりに、C++コードのためにObjective-CまたはCラッパーをつくってください。

source: Instead, import the Xcode-generated header file for your Swift code into any Objective-C .m file you want to use your Swift code from.
ja: その代わりに、あなたのスウィフトコードのためのXcode生成のヘッダ・ファイルを、あなたがそのコードを使いたい何らかのObjective-C .mファイルにインポートしてください。

source: Instead, it takes advantage of compile-time attributes, conditional compilation blocks, and language features to accomplish the same functionality.
ja: その代わりに、それは同じ機能性を達成するために、さまざまなコンパイル時属性、条件コンパイルブロック、そして言語機能を活用します。

source: Instead, use the Int.init(bitPattern:) initializer to interpret the optional pointer as an Int, which has the same C variadic calling conventions as a pointer on all supported platforms.
ja: その代わりに、Int.init(bitPattern:)イニシャライザを使ってオプショナルポインタをIntとして解釈してください、それはすべてのプラットホーム上でポインタと同じCの可変長引数呼び出し取り決めを持ちます。

source: Instead, you can forward declare a Swift class or protocol to reference it in an Objective-C interface.
ja: その代わりに、あなたはスウィフトのクラスやプロトコルを先に宣言して、Objective-Cインターフェイスにおいてそれを参照することができます。

source: Instead, you represent a value that could be missing by wrapping the type of the value in an optional type.
ja: 代わりに、あなたは見つからない値を、その型の値をオプショナル型の中にラップすることによって表わします。

source: Integrating with Interface Builder
ja: インタフェースビルダーと統合する

source: Interacting with C APIs
ja: C APIとの相互作用

source: Interacting with Objective-C APIs
ja: Objective-C APIとの相互作用

source: Interoperability
ja: 相互運用性

source: Interoperability lets you write Swift code that incorporates Objective-C behavior.
ja: 相互運用性は、あなたにObjective-C挙動を取り入れるスウィフトコードを書かせます。

source: Interoperability makes it possible to integrate those features back into Objective-C code with no hassle.
ja: 相互運用性は、それらの特徴をObjective-Cコードに逆に戻って統合することを面倒なしで可能にします。

source: Introspection
ja: 自己観察

source: Invoking a method using a selector is inherently unsafe, because the compiler cannot make any guarantees about the result, or even guarantee whether the object responds to the selector.
ja: メソッドをセレクタを使って発動することは、本質的に安全ではありません、なぜならコンパイラはその結果についてどんな保証も、またはオブジェクトがセレクタに応答するかどうかの保証さえもすることが不可能だからです。

source: It also contains those marked with the internal modifier if your app target has an Objective-C bridging header.
ja: それはまた、あなたのアプリターゲットがObjective-C橋渡しヘッダを持つならば、それらをinternal修飾子で印して含みます。

source: It also supports chaining through optional values within a chain, such as #keyPath(Person.bestFriend.name).
ja: それはまた、ある数珠つなぎ内でオプショナル値を通した連鎖をサポートします、例えば#keyPath(Person.bestFriend.name)など。

source: It can be thought of as an umbrella header for your Swift code.
ja: それは、あなたのスウィフトコードのためのアンブレラヘッダとみなされることができます。

source: It imports Objective-C class factory methods as Swift initializers, and Objective-C enumeration cases truncated names.
ja: それはObjective-Cファクトリメソッドをスウィフトイニシャライザとして、そして名前の先端を切ったObjective-C列挙をインポートします。

source: Just as in Objective-C, before you send a message that a delegate may not respond to, you ask the delegate whether it responds to the selector.
ja: ちょうどObjective-Cでのように、あなたが委任先が応答しないかもしれないメッセージを送る前に、あなたはその委任先にそれがセレクタに応答するかどうか尋ねます。

source: Key paths created using key-path expressions include type information about the properties they reference.
ja: キーパス式を使って作成されるキーパスは、それらが参照するプロパティについての型情報を含みます。

source: Key-Value Observing
ja: キー値監視

source: Key-value observing is a mechanism that allows objects to be notified of changes to specified properties of other objects.
ja: キー値監視は、オブジェクトが他のオブジェクトの指定されたプロパティに対する変更を通知されるようにする仕組みです。

source: Keys and Key Paths
ja: キーとキーパス

source: Keys and key paths are also used for key-value observing (KVO), a mechanism that enables an object to be notified directly when a property of another object changes.
ja: キーとキーパスはまた、他のオブジェクトのプロパティが変化した時にあるオブジェクトが直接に通知されることを可能にする仕組み、キー値監視（KVO）のためにも使われます。

source: Keys and key paths are frequently used for key-value coding (KVC), a mechanism for indirectly accessing an object’s attributes and relationships using string identifiers.
ja: キーとキーパスは、文字列識別子を使ってオブジェクトの属性および関連付け（リレーションシップ）に間接的にアクセスするための仕組み、キー値コーディング（KVC）のためにしばしば使われます。

source: Lazy Initialization
ja: 遅延初期化

source: Lazy properties are useful when the initial value for a property either requires complex or computationally expensive setup, or cannot be determined until after an instance’s initialization is complete.
ja: 遅延プロパティが便利なのは、あるプロパティに対する初期値が、複雑なもしくは計算的に高くつく準備を必要とする、またはあるインスタンスの初期化が完了する後まで決定されることが出来ない、このどちらかである場合です。

source: Lightweight Generics
ja: 軽量総称体

source: Like a C function pointer, a Swift function type with the @convention(c) attribute does not capture the context of its surrounding scope.
ja: C関数ポインタのように、@convention(c)属性を持つスウィフト関数型は、それを取り囲んでいるスコープのコンテキストをキャプチャしません。

source: Like blocks in Objective-C, closures in Swift also maintain strong references to any captured objects, including self.
ja: Objective-Cでのブロックのように、スウィフトでのクロージャもまた、selfを含めて、あらゆるキャプチャされたオブジェクトに対する強い参照を管理します。

source: Likewise, when Objective-C code imports Swift APIs, the importer also replaces Swift value types with their corresponding Objective-C reference types.
ja: 同様に、Objective-Cコードがスウィフト APIをインポートするとき、インポーターはまたスウィフト値型をそれらの対応するObjective-C参照型と置き換えます。

source: Live Rendering
ja: ライブレンダリング

source: Localization
ja: 現地語化

source: Making Objective-C Interfaces Unavailable in Swift
ja: Objective-Cインターフェイスをスウィフトで利用できなくする

source: Many Objective-C initializers in system frameworks have been audited to indicate whether initialization can fail.
ja: システムフレームワークの中の多くのObjective-Cイニシャライザは、初期化が失敗する可能性があるかどうか検査されてしまっています。

source: Many of these patterns rely on classes defined in Objective-C.
ja: これらのパターンの多くは、Objective-Cで定義されるクラスに頼ります。

source: Memory Managed Objects
ja: メモリ管理オブジェクト

source: Methods are imported and called as described in Working with Methods.
ja: メソッドは、メソッドを扱うで記述されるように、インポートされ呼び出されます。

source: Methods that consume errors, such as delegate methods or methods that take a completion handler with an NSError object argument, do not become methods that throw when imported by Swift.
ja: エラーを食べ尽くすメソッド、例えば委任先メソッドたちや完了ハンドラをNSErrorオブジェクト引数で取るメソッドたちは、スウィフトによってインポートされる時にスローするメソッドになりません。

source: Migrating Your Objective-C Code to Swift
ja: あなたのObjective-Cコードのスウィフトへの移行

source: Migration
ja: 移行

source: Mix and Match
ja: 混合と適合

source: Mix and Match Overview
ja: 混合と適合の概要

source: Mix-and-match functionality makes it easy to choose which features and functionality to implement in Swift, and which to leave in Objective-C.
ja: 混合と適合の機能性は、どの特徴と機能性をスウィフトにおいて実装するか、そしてどれをObjective-Cのままにしておくべきかを選択をするのを容易にします。

source: Most of the Objective-C system frameworks, including Foundation, already provide nullability annotations, allowing you to work with values in an idiomatic and type-safe manner.
ja: ほとんどのObjective-Cシステムフレームワーク、Foundationを含む、は、すでにヌル可能注釈を提供し、あなたに慣用句的な型安全な手法で値を扱えるようにします。

source: Mutable Pointers
ja: 可変ポインター

source: NSCoding
ja: NSCodingプロトコル

source: NSUndoManager supports two ways to register undo operations: a “simple undo”, which performs a selector with a single object argument, and an “invocation-based undo”, which uses an NSInvocation object that takes any number and any type of arguments.
ja: NSUndoManagerは、取り消し操作を登録する２つの方法をサポートします：ただ１つのオブジェクト引数を使ってセレクタを実行する「単純な取り消し」、そして随意の数の随意の型の引数を取るNSInvocationオブジェクトを使う「呼び出し基盤の取り消し」。

source: Naming Your Product Module
ja: あなたの製品モジュールに名前をつける

source: Nested types
ja: 入れ子にされた型

source: New document that describes various aspects of Swift 1.0 and its compatibility with the Objective-C language and Cocoa/Cocoa Touch frameworks.
ja: スウィフトのObjective-C言語やCocoa／Cocoa Touchフレームワークとの互換性の様々な面を解説する新しい文書。

source: No import statement
ja: インポート文なし

source: No import statement; Objective-C bridging header required
ja: インポート文なし；Objective-Cブリッジヘッダ必須

source: No import statement; Objective-C umbrella header required
ja: インポート文なし；Objective-Cアンブレラヘッダ必須

source: Note
ja: 注意

source: Note that after this cast, the dataSource constant is of type UITableViewDataSource, so you can only call methods and access properties defined on the UITableViewDataSource protocol.
ja: このキャストの後で、dataSource定数は型UITableViewDataSourceである点に注意してください、なのであなたはUITableViewDataSourceプロトコル上で定義されるメソッド呼び出しとプロパティアクセスができるだけです。

source: Note that the Swift interfaces in the generated header include references to all of the Objective-C types used in them.
ja: 生成されたヘッダの中のスウィフトインタフェースたちが、それらの中で使われるObjective-C型への全ての参照を含む点に注意してください。

source: Note that this list does not include arrays.
ja: このリストが配列を含まない点に注意してください。

source: Noted that C function pointers are now imported as CFunctionPointer.
ja: C関数ポインターは現在はCFunctionPointerとしてインポートされることを注記した。

source: Noted that the compiler does not implicitly synthesize the @objc attribute for private methods and properties.
ja: コンパイラはプライペートなメソッドおよびプロパティのための@objc属性を暗黙的に合成して作り出さないことを注記した。

source: Noted that types that are pointed to, like NSString **, are not bridged.
ja: ポインターを付けられる型、NSString **のようなものは、ブリッジされないことを注記した。

source: Notice also that “init” doesn’t appear anywhere when calling the Swift-style initializer.
ja: またスウィフト形式のイニシャライザを呼ぶとき「init」がどこにも現れないことに注目してください。

source: Notice that the removeItem(at:) method is imported by Swift with a Void return type, no error parameter, and a throws declaration.
ja: removeItem(at:)メソッドがスウィフトによってVoidの戻り型で、errorパラメーターなしで、そしてthrows宣言でインポートされることに注意してください。

source: Notice that you don’t need to call alloc; Swift handles this for you.
ja: あなたがallocを呼ぶ必要がないことに注意してください；スウィフトは、これをあなたの代わりに処理します。

source: Null Pointers
ja: ヌルポインタ

source: Nullability and Optionals
ja: ヌル許可とオプショナル

source: Numbers
ja: 数

source: Object Comparison
ja: オブジェクト比較

source: Object subscripting methods are imported by Swift as methods with double underscores (__) prepended to their base names, rather than as a Swift subscript, if either the getter or setter method is marked as NS_REFINED_FOR_SWIFT.
ja: オブジェクト添え字メソッドは、二重アンダースコア（__）をそれのベース名の前に付けられてスウィフトによってメソッドとしてインポートされます、スウィフト添え字としてではなく、もしゲッターとセッターメソッドの両方がNS_REFINED_FOR_SWIFTと印付けされるならば。

source: Objective-C Reference Type
ja: Objective-C参照型

source: Objective-C Syntax
ja: Objective-C構文

source: Objective-C and Swift files can coexist in a single project, whether the project was originally an Objective-C or Swift project.
ja: プロジェクトが元々はObjective-Cかスウィフトのプロジェクトであったかどうかに関係なく、Objective-Cとスウィフトのファイルは一つのプロジェクトにおいて共存することができます。

source: Objective-C blocks are automatically imported as Swift closures with Objective-C block calling convention, denoted by the @convention(block) attribute.
ja: Objective-Cのブロックは、Objective-Cのブロック呼出規約をもつスウィフトのクロージャとして自動的にインポートされ、それは@convention(block)属性で分かります。

source: Objective-C can use nullability annotations to designate whether a parameter type, property type, or return type, can have a NULL or nil value.
ja: Objective-Cは、ヌル許可注釈を使って、あるパラメーター型、プロパティ型、または戻り値型がNULLまたはnil値を持つことが可能かどうか任命できます。

source: Objective-C classes qualified by one or more protocols are imported by Swift as protocol composition types.
ja: １つ以上のプロトコルによって適格にされるObjective-Cクラスは、スウィフトによってプロトコル合成型としてインポートされます。

source: Objective-C code
ja: Objective-Cコード
